{
  "backend/main.mo": "Motoko canister managing vehicles, reviews, contact forms, user profiles, and admin-controlled currency/cost settings with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping specific frontend files to features, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files including pages, components, and hooks.",
  "frontend/index.css": "Tailwind-based global theme defining OKLCH color variables for light/dark modes and applying base styles.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, lazy-loaded vehicle detail page, and conditional profile setup modal.",
  "frontend/src/components/ContactFormModal.tsx": "Modal for submitting contact forms with validation, state handling, and backend submission via React Query.",
  "frontend/src/components/ContactRequestsTab.tsx": "Displays, sorts, and deletes contact form submissions with table and mobile views.",
  "frontend/src/components/Footer.tsx": "Renders a minimal footer container with removed content.",
  "frontend/src/components/Header.tsx": "Handles authentication, admin settings, navigation, and modals for currency and cost settings.",
  "frontend/src/components/ImageLightbox.tsx": "Provides a fullscreen lightbox with keyboard, swipe, and arrow navigation plus image prefetching.",
  "frontend/src/components/ImagePrefetcher.tsx": "Prefetches upcoming images using ProgressiveImage for smoother gallery navigation.",
  "frontend/src/components/LazyImage.tsx": "Implements lazy loading for images using IntersectionObserver with a loading fallback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal requesting the user's name and saves it via a profile mutation.",
  "frontend/src/components/ProgressiveImage.tsx": "Loads images progressively with preview, WebP support, lazy loading, and prefetch options.",
  "frontend/src/components/ReviewEditModal.tsx": "Modal for editing a review with text fields, image management, and upload progress, submitting changes via useEditReview.",
  "frontend/src/components/ReviewFormModal.tsx": "Modal for submitting a new review, handling form fields, image uploads with previews, and sending data through useSubmitReview.",
  "frontend/src/components/VehicleCard.tsx": "Displays a vehicle preview card with main details, image loading, cost calculation, and prefetching data on hover.",
  "frontend/src/components/VehicleFormModal.tsx": "Form modal for creating or editing a vehicle, supporting image uploads, deletion, duplication, and cost calculation.",
  "frontend/src/components/VehicleModal.tsx": "Empty or missing component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and mutating user profiles, admin status, currency settings, vehicles, and reviews with caching and toast notifications.",
  "frontend/src/index.css": "Defines global Tailwind CSS themes, color variables, dark mode overrides, and utility classes like gradients and text shadows.",
  "frontend/src/lib/priceCalculator.ts": "Implements vehicle cost calculation utilities including customs duty, price breakdown, and formatting helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CatalogPage.tsx": "Renders vehicle catalog with filtering, pagination, infinite scroll, admin actions, and modals for adding or contacting.",
  "frontend/src/pages/MainPage.tsx": "Displays landing page with hero section, reviews carousel, and admin-editable review modals with lazy loading.",
  "frontend/src/pages/VehicleDetailPage.tsx": "Shows detailed vehicle info with image gallery, swipe navigation, price breakdown, and admin editing.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for Vehicle, Review, and ContactFormSubmission used across the app.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Holds project metadata, feature descriptions, known issues, and current architectural state for the car‑listing site."
}